# Arthimetic Operators

- we can perform Arthimetic operations on dataframes
- like addition, subtraction, multiplication and division

In [28]:
import pandas as pd

In [29]:
data=pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})
data

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [30]:
data["sub"]=data["A"]-data["B"]
data

   A  B  sub
0  1  5   -4
1  2  6   -4
2  3  7   -4
3  4  8   -4

In [31]:
data["sum"]=data["B"]+data['A']
data

   A  B  sub  sum
0  1  5   -4    6
1  2  6   -4    8
2  3  7   -4   10
3  4  8   -4   12

In [32]:
data["Multi"]=data["B"]*data['A']
data

   A  B  sub  sum  Multi
0  1  5   -4    6      5
1  2  6   -4    8     12
2  3  7   -4   10     21
3  4  8   -4   12     32

In [33]:
data["Greater"]=data["sum"]<10
data

   A  B  sub  sum  Multi  Greater
0  1  5   -4    6      5     True
1  2  6   -4    8     12     True
2  3  7   -4   10     21    False
3  4  8   -4   12     32    False